app/views/homepage/home.haml

            /       .item.active
            /         %img.img-responsive{:alt => "...", :src => asset_path(ListingImage.find(image.listing_id).image.url(:original))}
---
SELECT  `listing_images`.* FROM `listing_images` WHERE `listing_images`.`id` = 63 LIMIT 1

            /       .item.active
            /         %img.img-responsive{:alt => "...", :src => asset_path(ListingImage.find(image.listing_id).image.url(:original))}
---
SELECT  `listing_images`.* FROM `listing_images` WHERE `listing_images`.`id` = 66 LIMIT 1