app/helpers/application_helper.rb

    ]

    # Disabled for Braintree and Checkout
    gw = PaymentGateway.where(community_id: @current_community.id).first
---
SELECT  `payment_gateways`.* FROM `payment_gateways` WHERE `payment_gateways`.`community_id` = 1  ORDER BY `payment_gateways`.`id` ASC LIMIT 1