app/helpers/communities_helper.rb

  def show_slider_image(listing_id)
    return ListingImage.find(listing_id)
---
SELECT  `listing_images`.* FROM `listing_images` WHERE `listing_images`.`id` = 62 LIMIT 1