app/helpers/homepage_helper.rb

SELECT  `listings`.* FROM `listings` WHERE `listings`.`id` = 8 LIMIT 1
SELECT `listing_images`.* FROM `listing_images` WHERE `listing_images`.`listing_id` = 8 AND (error IS NULL)
---
  def get_image_url listing
    array = []
    Listing.find(listing.id).listing_images.each_with_index do |list , i|