app/controllers/application_controller.rb

    @return_to = new_path

    Maybe(@current_community).each { |community|
      @community_customization = community.community_customizations.where(locale: locale).first
---
SELECT  `community_customizations`.* FROM `community_customizations` WHERE `community_customizations`.`community_id` = 1 AND `community_customizations`.`locale` = 'en'  ORDER BY `community_customizations`.`id` ASC LIMIT 1

  def perform_redirect
    community = Maybe(@current_community).map { |c|
      {
        ident: c.ident,
        domain: c.domain,
        deleted: c.deleted?,
        use_domain: c.use_domain?,
        domain_verification_file: c.dv_test_file_name,
        closed: Maybe(@current_plan)[:closed].or_else(false)
      }
    }.or_else(nil)

    paths = {
      community_not_found: Maybe(APP_CONFIG).community_not_found_redirect.map { |url| {url: url} }.or_else({route_name: :community_not_found_path}),
      new_community: {route_name: :new_community_path}
    }

    configs = {
      always_use_ssl: Maybe(APP_CONFIG).always_use_ssl.map { |v| v == true || v.to_s.downcase == "true" }.or_else(false), # value can be string if it comes from ENV
      app_domain: URLUtils.strip_port_from_host(APP_CONFIG.domain),
    }

    other = {
      no_communities: Community.count == 0,
      community_search_status: community_search_status,
    }
---
SELECT COUNT(*) FROM `communities`

  def self.find_community(identifiers)
    by_identifier = Community.find_by_identifier(identifiers)

    if by_identifier
      by_identifier
    elsif Community.count == 1
      Community.first
---
SELECT COUNT(*) FROM `communities`
SELECT  `communities`.* FROM `communities`  ORDER BY `communities`.`id` ASC LIMIT 1

  def fetch_community_membership
    if @current_user
      puts @current_user.inspect , "*"*50 , @current_community.inspect
      @current_community_membership = CommunityMembership.where(person_id: @current_user.id, community_id: @current_community.id, status: "accepted").first
---
SELECT  `community_memberships`.* FROM `community_memberships` WHERE `community_memberships`.`person_id` = 'wCm2mKvPaDcZlqsDhqWKWA' AND `community_memberships`.`community_id` = 1 AND `community_memberships`.`status` = 'accepted'  ORDER BY `community_memberships`.`id` ASC LIMIT 1