app/controllers/homepage_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`community_id` = 1  ORDER BY sort_priority
SELECT `categories`.* FROM `categories` WHERE `categories`.`parent_id` IN (2, 3, 8, 9, 10, 11, 12, 13, 14, 15, 16)  ORDER BY sort_priority
SELECT `custom_fields`.* FROM `custom_fields` WHERE `custom_fields`.`community_id` = 1 AND `custom_fields`.`search_filter` = 1
---
  def home
    @homepage = true
    @first_slider_images = FeaturedSlider.where :image_for => 1
    @second_slider_images = FeaturedSlider.where :image_for => 2
    @view_type = HomepageController.selected_view_type(params[:view], @current_community.default_browse_view, APP_DEFAULT_VIEW_TYPE, VIEW_TYPES)

    @categories = @current_community.categories.includes(:children)
    @main_categories = @categories.select { |c| c.parent_id == nil }

    all_shapes = shapes.get(community_id: @current_community.id)[:data]

    # This assumes that we don't never ever have communities with only 1 main share type and
    # only 1 sub share type, as that would make the listing type menu visible and it would look bit silly
    listing_shape_menu_enabled = all_shapes.size > 1
    @show_categories = @categories.size > 1
    show_price_filter = @current_community.show_price_filter && all_shapes.any? { |s| s[:price_enabled] }

    filters = @current_community.custom_fields.where(search_filter: true).sort