app/controllers/listings_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`parent_id` IN (2, 3, 8, 9, 10, 11, 12, 13, 14, 15, 16)  ORDER BY sort_priority
SELECT  `listing_images`.* FROM `listing_images` WHERE `listing_images`.`listing_id` = 8 AND (error IS NULL)  ORDER BY `listing_images`.`id` ASC LIMIT 1
---
  def show
    @categories = @current_community.categories.includes(:children)
    @main_categories = @categories.select { |c| c.parent_id == nil }
    @selected_tribe_navi_tab = "home"

    @current_image = if params[:image]
      @listing.image_by_id(params[:image])
    else
      @listing.listing_images.first

SELECT  `listings`.* FROM `listings` WHERE `listings`.`community_id` = 1 AND `listings`.`id` = 1 LIMIT 1
UPDATE `listings` SET `sort_date` = '2016-05-06 10:58:37', `updated_at` = '2016-05-06 10:58:37' WHERE `listings`.`id` = 1
---
  def move_to_top
    @listing = @current_community.listings.find(params[:id])

    # Listings are sorted by `sort_date`, so change it to now.
    if @listing.update_attribute(:sort_date, Time.now)

SELECT  `listings`.* FROM `listings` WHERE `listings`.`community_id` = 1 AND `listings`.`id` = 8 LIMIT 1
---
  def ensure_authorized_to_view
    # If listing is not found (in this community) the find method
    # will throw ActiveRecord::NotFound exception, which is handled
    # correctly in production environment (404 page)
    @listing = @current_community.listings.find(params[:id])