app/controllers/people_controller.rb

  def show

    @categories = @current_community.categories.includes(:children)
    @main_categories = @categories.select { |c| c.parent_id == nil }

    @person = Person.find_by!(username: params[:username], community_id: @current_community.id)
    raise PersonDeleted if @person.deleted?

    redirect_to root and return if @current_community.private? && !@current_user
    @selected_tribe_navi_tab = "members"
    @community_membership = CommunityMembership.find_by_person_id_and_community_id_and_status(@person.id, @current_community.id, "accepted")
---
SELECT  `community_memberships`.* FROM `community_memberships` WHERE `community_memberships`.`person_id` = 'Mv7DsWSUM9EAycvAicHkBw' AND `community_memberships`.`community_id` = 1 AND `community_memberships`.`status` = 'accepted' LIMIT 1