app/models/community.rb

  def self.find_by_identifier(identifiers)
    priority = [:id, :ident, :domain]

    identifier_to_use = priority.find { |identifier| identifiers[identifier].present? }

    if identifier_to_use.nil?
      nil
    else
      Community.where({ identifier_to_use => identifiers[identifier_to_use]}).first
---
SELECT  `communities`.* FROM `communities` WHERE `communities`.`domain` = 'commerce.codingstack.com'  ORDER BY `communities`.`id` ASC LIMIT 1
SELECT  `communities`.* FROM `communities` WHERE `communities`.`ident` = 'vendor-advisor'  ORDER BY `communities`.`id` ASC LIMIT 1