app/views/layouts/index.haml

SELECT `menu_links`.* FROM `menu_links` WHERE `menu_links`.`community_id` = 1  ORDER BY sort_priority
---
                        %li
                          - Maybe(@current_community).menu_links.each do |menu_links|